trunk/RestNet-WebApp/app/controllers/fb_connect_controller.rb

  def connect
    begin
      secure_with_token!
      session[:facebook_session] = @facebook_session
      logger.debug "facebook session in connect: #{facebook_session.inspect}"
      raise Webapp::NoFBSessionError unless @facebook_session
      #Ok, there is a session
      if (facebook_user )
        user = User.find_by_fb_uid(facebook_user.uid)
---
SELECT * FROM `users` WHERE (`users`.`fb_uid` = 1626128749) LIMIT 1