trunk/RestNet-WebApp/app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `activation_key`, `handle`, `created_at`, `updated_at`, `hashed_password`, `admin`, `fb_uid`, `last_name`, `first_name`, `email`, `active`) VALUES(NULL, NULL, 'gxyprrnfrxvvwxe', '2010-01-11 17:04:06', '2010-01-11 17:04:06', NULL, 0, 1626128749, 'last_name', 'first name', 'gdesquina@gmail.com', 1)
---
  def create
    #Create user instance
    @user = User.new(params[:user])
    @user.fb_uid = facebook_user.uid if facebook_user
    if @user.save

INSERT INTO `password_recoveries` (`created_at`, `updated_at`, `user_id`, `key`) VALUES('2010-01-11 17:03:36', '2010-01-11 17:03:36', 127326141, '49b37796756d251c2b6e434fecec35aff6e919a75f2bfc18642ea567fc9dcb56')
---
  def recover_password
    raise Webapp::UserSessionExistsError if user_session
    if request.get?
      @handle_or_user_name = ""

    elsif request.post?
      @handle_or_user_name = params[:handle_or_email]
      raise Webapp::BadParametersError if @handle_or_user_name.nil? || @handle_or_user_name.empty?
      user = User.find_by_handle_or_email(@handle_or_user_name)
      #Should create a PasswordRecovery
      password_recovery = PasswordRecovery.create_password_recovery(user.id)

SELECT * FROM `users` WHERE (`users`.`id` = 127326141)
SELECT * FROM `password_recoveries` WHERE (`password_recoveries`.`user_id` = '127326141') LIMIT 1
---
  def reset_password
    if request.get?
      @key = params[:key]
      @user_id = params[:id]
      @password = ""
      @password_confirmation =""
      raise Webapp::BadParametersError if @key.nil? || @user_id.nil?
      user = User.find(@user_id)
      #check if user has previouly requested a chenge to the password
      password_recovery = PasswordRecovery.find_by_user_id(@user_id)

DELETE FROM `password_recoveries` WHERE `id` = 949913489
UPDATE `users` SET `updated_at` = '2010-01-11 17:04:06', `salt` = '-6128888081263229446', `hashed_password` = '92200d9df3f21c657d13ec5610636cd387c8d3b6' WHERE `id` = 892824791
---
      #Do this inside a small transaction
      user.transaction do
        user.password=@password
        PasswordRecovery.destroy(password_recovery.id)
        user.save!

SELECT * FROM `users` WHERE (`users`.`id` = 831119089)
UPDATE `users` SET `updated_at` = '2010-01-11 17:04:37', `salt` = '-6128110081263229477', `hashed_password` = '8a153b2f8cdde867aba330a8bc9d9f9b09046bf7' WHERE `id` = 892824791
---
  def change_password
    if request.get?
      @current_password=""
      @password=""
      @password_confirmation=""
    elsif request.put?
      @current_password = params[:current_password]
      @password = params[:password]
      @password_confirmation = params[:password_confirmation]
      user = User.find(params[:id])

      raise Webapp::WrongPasswordError unless User.authenticate_with_handle_or_email(user.handle, @current_password)
      raise Webapp::NoPasswordMatchError if @password != @password_confirmation
      raise Webapp::InvalidPasswordError if @password.size < 5 || @password.size > 150
      user.password=@password
      user.save

SELECT * FROM `users` WHERE (`users`.`id` = 127326141)
UPDATE `users` SET `updated_at` = '2010-01-11 17:03:36', `active` = 1 WHERE `id` = 127326141
---
  def activate
    #Get from the params hash the activation key
    activation_key = params[:activation_key]
    #Get from the params Hash the user id
    user_id =params[:id]
    @user = User.find(user_id)
    #check if the key is valid

    #raise and exception if the user is already active
    raise SecurityError if @user.active?

    #raise an exception if the activation keys do not match
    raise ArgumentError if activation_key != @user.activation_key

    @user.active=1
    @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 127326141)
---
  def edit
    #@user = get_user_for_update(params[:id])
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 127326141)
UPDATE `users` SET `updated_at` = '2010-01-11 17:04:37', `last_name` = 'new last name', `first_name` = 'new first name', `email` = 'jonhy@gmail.com' WHERE `id` = 892824791
---
  def update
    #Can update first name, last name, email and handle
    #@user = get_user_for_update(params[:id])
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 892824791)
DELETE FROM `users` WHERE `id` = 892824791
---
  def destroy
    #raise Webapp::NotAllowedError unless has_session?
    #user = User.find(user_session.user_id)
    #@user = get_user_for_update(params[:id])
    @user = User.find(params[:id])
    #raise Webapp::NotAllowedError unless user.admin || user.id == @user.id
    @user.destroy